app/Models/DetailTransaksiModel.php

    public function getDetailTransaksi($id = false)
    {
        if ($id == false) {
            return $this->db->table('detail_transaksi')
                ->join('produk', 'produk.id_produk = detail_transaksi.id_produk')
                ->get()
                ->getResultArray();
        }
        return $this->db->table('detail_transaksi')
            ->join('produk', 'produk.id_produk = detail_transaksi.id_produk')
            ->where(['id_transaksi' => $id])
            ->get()
            ->getResultArray();
---
SELECT *
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id_produk` = `detail_transaksi`.`id_produk`
WHERE `id_transaksi` = 'T-20240121-1210'