app/Models/KeranjangModel.php

    public function getKeranjang($id = false)
    {
        if ($id == false) {
            return $this->db->table('cart')
                ->join('produk', 'produk.id_produk = cart.id_produk')
                ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
                ->get()
                ->getResultArray();
        }
        return $this->db->table('cart')
            ->join('produk', 'produk.id_produk = cart.id_produk')
            ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
            ->where(['id_user' => $id])
            ->orderBy('id_cart', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `cart`
JOIN `produk` ON `produk`.`id_produk` = `cart`.`id_produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`
WHERE `id_user` = '3'
ORDER BY `id_cart` DESC

    public function getCountKeranjang($id)
    {
        return $this->db->table('cart')
            ->where(['id_user' => $id])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `id_user` = '3'

    public function checkAdded($id_user, $id_produk)
    {
        return $this->db->table('cart')
            ->where(['id_user' => $id_user, 'id_produk' => $id_produk])
            ->get()
            ->getRowArray();
---
SELECT *
FROM `cart`
WHERE `id_user` = '3'
AND `id_produk` = '14'