app/Models/ProdukModel.php

    public function getProduk($id = false)
    {
        if ($id === false) {
            return $this->table('produk')
                ->select('produk.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
                ->get()
                ->getResultArray();
        } else {
            return $this->table('produk')
                ->select('produk.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
                ->where('produk.id_produk', $id)
                ->get()
                ->getRowArray();
---
SELECT `produk`.*, `kategori`.`nama_kategori`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`
SELECT `produk`.*, `kategori`.`nama_kategori`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`
WHERE `produk`.`id_produk` = '14'

    public function getCountProduk()
    {
        return $this->db->table('produk')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`