app/Models/TransaksiModel.php

    public function getTransaksi($id = false)
    {
        if ($id == false) {
            return $this->db->table('transaksi')
                ->join('user', 'user.id_user = transaksi.id_user')
                ->get()
                ->getResultArray();
        }
        return $this->db->table('transaksi')
            ->join('user', 'user.id_user = transaksi.id_user')
            ->where(['id_transaksi' => $id])
            ->get()
            ->getRowArray();
---
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
WHERE `id_transaksi` = 'T-20240121-1210'

    public function getActiveTransaksiCount($id)
    {
        return $this->db->table('transaksi')
            ->where(['id_user' => $id])
            ->where('status !=', 'Selesai')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `id_user` = '3'
AND `status` != 'Selesai'

    public function getTransaksiSelesai()
    {
        return $this->db->table('transaksi')
            ->join('user', 'user.id_user = transaksi.id_user')
            ->where('status', 'Selesai')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
WHERE `status` = 'Selesai'

    public function getTransaksiSelesaiByBulan($bulan = false)
    {
        if ($bulan) {
            return $this->db->table('transaksi')
                ->join('user', 'user.id_user = transaksi.id_user')
                ->where('status', 'Selesai')
                ->where('MONTH(created_at)', $bulan)
                ->get()
                ->getResultArray();
        } else {
            return $this->db->table('transaksi')
                ->join('user', 'user.id_user = transaksi.id_user')
                ->where('status', 'Selesai')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
WHERE `status` = 'Selesai'
AND MONTH(created_at) = '1'
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
WHERE `status` = 'Selesai'

    public function getCountTransaksiSelesai()
    {
        return $this->db->table('transaksi')
            ->where('status', 'Selesai')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `status` = 'Selesai'

    public function getSumTransaksiSelesai()
    {
        return $this->db->table('transaksi')
            ->where('status', 'Selesai')
            ->selectSum('total_bayar')
            ->get()
            ->getRowArray();
---
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `status` = 'Selesai'

    public function getGrafikTransaksi()
    {
        return $this->db->table('transaksi')
            ->select('MONTH(created_at) as bulan, COUNT(id_transaksi) as jumlah')
            ->where('status', 'Selesai')
            ->groupBy('MONTHNAME(created_at)')
            ->orderBy('MONTHNAME(created_at)', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT MONTH(created_at) as bulan, COUNT(id_transaksi) as jumlah
FROM `transaksi`
WHERE `status` = 'Selesai'
GROUP BY MONTHNAME(created_at)
ORDER BY MONTHNAME(created_at) ASC

    public function getGrafikPendapatan()
    {
        return $this->db->table('transaksi')
            ->select('MONTH(created_at) as bulan, SUM(total_bayar) as total')
            ->where('status', 'Selesai')
            ->groupBy('MONTHNAME(created_at)')
            ->orderBy('MONTHNAME(created_at)', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT MONTH(created_at) as bulan, SUM(total_bayar) as total
FROM `transaksi`
WHERE `status` = 'Selesai'
GROUP BY MONTHNAME(created_at)
ORDER BY MONTHNAME(created_at) ASC