app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `id_user` = '3'
---
    public function getUser($id = false)
    {
        if ($id == false) {
            return $this->db->table('user')
                ->get()
                ->getResultArray();
        }
        return $this->db->table('user')
            ->where(['id_user' => $id])
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function getCountUser()
    {
        return $this->db->table('user')
            ->countAllResults();